workspace/inventoryApp-pt4/app/controllers/items_controller.rb

  def create
    @item = Item.create(item_params)
---
INSERT INTO "items" ("asset_number", "created_at", "description", "features", "item_category_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)