workspace/inventoryApp-pt4/app/controllers/item_categories_controller.rb

INSERT INTO "item_categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2017-10-23 21:05:39.412348"], ["name", "Notebook"], ["updated_at", "2017-10-23 21:05:39.412348"]]
---
  def create
    @item_category = ItemCategory.new(item_category_params)

    respond_to do |format|
      if @item_category.save

SELECT  "item_categories".* FROM "item_categories"  WHERE "item_categories"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_item_category
      @item_category = ItemCategory.find(params[:id])