workspace/inventoryApp-pt3/app/views/items/new.html.erb

SELECT "item_categories".* FROM "item_categories"
---
  <%= f.label :item_category %>
  <%= collection_select(:item, :item_category, ItemCategory.all, :id, :name) %>