workspace/inventoryApp-pt2/app/controllers/items_controller.rb

SELECT  "items".* FROM "items"  WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @item = Item.find(params[:id])

INSERT INTO "items" ("asset_number", "created_at", "description", "features", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    @item.save