workspace/testando_controllers/app/controllers/challenges_controller.rb

  def create
    @challenge = Challenge.new(challenge_params)
    if @challenge.save
---
INSERT INTO "challenges" ("name", "description", "code_points", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "teste"], ["description", "Fazer teste"], ["code_points", 60], ["created_at", "2017-10-27 00:48:32.892724"], ["updated_at", "2017-10-27 00:48:32.892724"]]

  def show
    @challenge = Challenge.find(params[:id])
---
SELECT  "challenges".* FROM "challenges" WHERE "challenges"."id" = ? LIMIT 1  [["id", 1]]