workspace/rails_basico_3_form/app/controllers/opinions_controller.rb

INSERT INTO "opinions" ("body") VALUES (?)  [["body", "Rails is awesome!"]]
---
  def create
    @opinion = Opinion.new(opinion_params)
    @opinion.save

SELECT  "opinions".* FROM "opinions" WHERE "opinions"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @opinion = Opinion.find(params[:id])