workspace/inventoryApp-pt4/app/views/items/new.html.erb

  <%= f.label :item_category_id %>
  <%= f.collection_select(:item_category_id, ItemCategory.all, :id, :name) %>
---
SELECT "item_categories".* FROM "item_categories"