workspace/inventoryApp-pt3/app/controllers/items_controller.rb

SELECT "item_categories".* FROM "item_categories"
---
  def new
    @item = Item.new
    @item_category = ItemCategory.all

INSERT INTO "items" ("asset_number", "created_at", "description", "features", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.create(item_params)