workspace/rails_basico_6_associations/app/controllers/agrees_controller.rb

  def create
    @opinion = Opinion.find(params[:opinion_id])
    @opinion.agrees << Agree.new
---
SELECT  "opinions".* FROM "opinions" WHERE "opinions"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "agrees" ("opinion_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["opinion_id", 1], ["created_at", "2017-10-18 15:56:00.471726"], ["updated_at", "2017-10-18 15:56:00.471726"]]